<?php

$rain = 'ฝนตกไม่ตก';

if($rain =='ฝนตก'){
  echo 'ผมจะนอนบนเตียง';
}else {
  echo 'ผมจะออกไปซื้อของข้างนอก';
}





// $i = 3;
//
// if($i == 1){
//   echo $i;
// }else if($i==2){
//   echo $i;
// }else if($i==3){
//   echo $i;
// }else{
//   echo $i;
// }





// $a = 1;
// $b = 1;
// if ($a <= $b) {
//   // code...
//   echo 'ไม่จริง';
// }else {
//   // code...
//   echo 'จริง';
// }








// if (1 == 2) {
//   // code...
//
//   echo '1=1 มีค่าเท่ากับ ' . 'จริง';
//
// }else {
//   // code...
//   echo '1=2 มีค่าเท่ากับ'. 'ไม่จริง';
//
// }

 ?>
